;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
;;

(package! haskell-mode)
(package! flycheck-haskell)
(package! merlin)
(package! tuareg)
(package! flycheck-ocaml)
(package! typescript-mode)
(package! proof-general)
(package! coq-commenter)
(package! racer)
(package! rust-mode)
(package! flycheck-rust)
(package! company-coq)
(package! company-cabal)
(package! company-racer)
(package! mips-mode)
(package! elixir-mode)
(package! alchemist)
(package! flycheck-elixir)
(package! writeroom-mode)
(package! boogie-friends)
(package! org-super-agenda)
(package! go-mode)
